import React from 'react'
import { Link } from 'react-router-dom';


function Description () {
  return (
      
       <div className=' w-full flex items-center justify-center lg:gap-2 lg:p-0 md:gap-4 md:p-4 md:pt-2 pt-2' >

        
                       <Link className='hidden sm:flex items-center justify-center lg:w-[54%]' to="/Brand">
                  <div className="  h-[197px] w-full flex flex-col items-start p-8 gap-4 bg-[#F2EEFC] rounded-[16px]">
                   <div className=" w-full flex flex-row items-center justify-between">
                       <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
         <rect width="48" height="48" rx="24" fill="url(#paint0_linear_1_317)"/>
         <path d="M24 11.5C20.5595 11.5 17.75 14.3095 17.75 17.75C17.75 21.1905 20.5595 24 24 24C26.4399 24 28.7928 22.535 30.6199 21.1545C32.447 19.7741 33.7449 18.3921 33.7449 18.3921C33.9083 18.2182 33.9992 17.9886 33.9992 17.75C33.9992 17.5114 33.9083 17.2818 33.7449 17.1079C33.7449 17.1079 32.447 15.7259 30.6199 14.3455C28.7928 12.965 26.4399 11.5 24 11.5ZM24 13.375C25.6226 13.375 27.801 14.5663 29.4895 15.842C30.753 16.7967 31.2338 17.3301 31.6526 17.75C31.2338 18.1699 30.753 18.7033 29.4895 19.658C27.801 20.9337 25.6226 22.125 24 22.125C21.573 22.125 19.625 20.177 19.625 17.75C19.625 15.323 21.573 13.375 24 13.375ZM16.4866 26.5C15.1242 26.5 14 27.6242 14 28.9866V29.9375C14 32.1901 15.4245 33.9326 17.3167 34.9766C19.2088 36.0205 21.6051 36.5 24 36.5C26.3949 36.5 28.7912 36.0205 30.6833 34.9766C32.5751 33.9328 33.9995 32.1907 34 29.9387L34.0012 28.9878V28.9866C34.0012 27.6242 32.8758 26.5 31.5134 26.5H16.4866ZM16.4866 28.375H22.5571L23.4641 30.3391L21.8162 34.4602C20.4668 34.2598 19.2088 33.8801 18.2224 33.3359C16.7161 32.5049 15.875 31.4349 15.875 29.9375V28.9866C15.875 28.6377 16.1377 28.375 16.4866 28.375ZM25.4429 28.375H31.5134C31.8623 28.375 32.1262 28.6377 32.1262 28.9866L32.125 29.9375C32.125 31.4349 31.2839 32.5049 29.7776 33.3359C28.7912 33.8801 27.5332 34.2598 26.1838 34.4602L24.5359 30.3391L25.4429 28.375Z" fill="#F2EEFC"/>
         <defs>
         <linearGradient id="paint0_linear_1_317" x1="46.386" y1="2.4385" x2="-4.92631" y2="18.5572" gradientUnits="userSpaceOnUse">
         <stop stop-color="#8061D9"/>
         <stop offset="1" stop-color="#6A4BC4"/>
         </linearGradient>
         </defs>
         </svg>
                     <div className='flex flex-col items-end w-full justify-center w-[200px]' >
                     <span className='text-[#8061D9] tracking-widest font-sans pb-1'>0 7   L E V E L S</span>
                     <h1 className='text-[#312651] font-bold text-xl font-[YekanBakh-ExtraBold]'>برند سازی شخصی</h1>
                     </div>
                     <div>
                      
         
         
                     </div>
                    
                   </div>
                   <div className="flex items-center justify-center leading-5 text-[15px] md:text-[13px] w-full font-[IranSans]" dir="rtl">
                     <p className='text-[#312651]'>برندسازی شخصی یعنی ساختن تصویری از خودت که فقط بر پایه قضاوت های بیرونی نیست، بلکه بیانگر داستان، ارزش ها، اهداف و قدرت درون توست!</p>
                   </div>
                  </div>
                       </Link>
          
        <Link className='flex items-center justify-center lg:w-[38%] md:w-[40%] w-full' to="/Woman">
         <div className=" w-[342px] lg:w-full h-[197px] flex flex-col items-start p-8 gap-4 bg-[#F2EEFC] rounded-[16px]">
          <div className=" w-full flex flex-row items-center justify-between">
             <div>
              <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="48" height="48" rx="24" fill="url(#paint0_linear_1_324)"/>
<path d="M24.31 12.125C23.3983 12.125 22.524 12.4872 21.8793 13.1318C21.2347 13.7765 20.8725 14.6508 20.8725 15.5625C20.8725 16.4742 21.2347 17.3485 21.8793 17.9932C22.524 18.6378 23.3983 19 24.31 19C25.2217 19 26.096 18.6378 26.7407 17.9932C27.3854 17.3485 27.7475 16.4742 27.7475 15.5625C27.7475 14.6508 27.3854 13.7765 26.7407 13.1318C26.096 12.4872 25.2217 12.125 24.31 12.125ZM23.0405 20.25C21.9996 20.25 21.1026 20.8255 20.6223 21.6697C20.6113 21.6861 20.6007 21.7028 20.5905 21.7197L17.4497 26.8625L13.9292 29.21C13.7898 29.2998 13.6696 29.4164 13.5757 29.5531C13.4819 29.6898 13.4161 29.8438 13.3823 30.0061C13.3485 30.1684 13.3474 30.3359 13.3789 30.4987C13.4104 30.6615 13.4741 30.8164 13.566 30.9543C13.658 31.0923 13.7765 31.2106 13.9147 31.3023C14.0528 31.394 14.2078 31.4574 14.3707 31.4886C14.5335 31.5199 14.7009 31.5184 14.8632 31.4843C15.0255 31.4502 15.1794 31.3842 15.3159 31.29L19.0659 28.79C19.2171 28.6893 19.3446 28.5569 19.4394 28.4019L19.9448 27.573C19.8753 28.3884 20.0492 29.1618 20.5808 29.8752L17.363 32.634C16.833 33.0884 16.6052 33.8029 16.7746 34.4797C16.9796 35.2997 17.7167 35.875 18.5617 35.875H21.8039C21.6152 35.5325 21.4975 35.1457 21.4975 34.7275C21.4975 33.4644 22.486 32.4131 23.7473 32.335L27.0847 32.1262C27.4228 32.1006 27.725 32.3659 27.7475 32.7109C27.7688 33.0559 27.5072 33.3519 27.1628 33.3738L23.8242 33.5825C23.2204 33.6194 22.7475 34.1225 22.7475 34.7275C22.7475 35.3607 23.2619 35.875 23.895 35.875H30.0595C30.9052 35.875 31.6422 35.3004 31.8479 34.4797C32.0172 33.8029 31.7889 33.0884 31.2595 32.634L28.0417 29.8752C28.5745 29.113 28.7313 28.3367 28.6655 27.5522L29.1806 28.3994C29.2752 28.5553 29.4027 28.6886 29.5542 28.79L33.3042 31.29C33.4407 31.3842 33.5945 31.4502 33.7568 31.4843C33.9191 31.5184 34.0865 31.5199 34.2494 31.4886C34.4122 31.4574 34.5672 31.394 34.7054 31.3023C34.8435 31.2106 34.962 31.0923 35.054 30.9543C35.146 30.8164 35.2096 30.6615 35.2411 30.4987C35.2727 30.3359 35.2715 30.1684 35.2377 30.0061C35.2039 29.8438 35.1382 29.6898 35.0443 29.5531C34.9504 29.4164 34.8303 29.2998 34.6909 29.21L31.1716 26.8638L28.0564 21.7417C28.0298 21.6968 28.0004 21.6536 27.9685 21.6123C27.4804 20.7991 26.5985 20.25 25.5808 20.25H23.0405ZM23.2785 25.2537C23.5975 25.2293 23.9252 25.3265 24.1867 25.5515L24.31 25.6577L24.4333 25.5515C24.9564 25.1009 25.7466 25.1614 26.196 25.6858C26.6466 26.2089 26.5867 26.9985 26.063 27.4485L24.31 28.9524L22.5583 27.4485C22.0346 26.9985 21.974 26.2095 22.424 25.6858C22.649 25.4239 22.9595 25.278 23.2785 25.2537Z" fill="#F2EEFC"/>
<defs>
<linearGradient id="paint0_linear_1_324" x1="46.386" y1="2.4385" x2="-4.92631" y2="18.5572" gradientUnits="userSpaceOnUse">
<stop stop-color="#8061D9"/>
<stop offset="1" stop-color="#6A4BC4"/>
</linearGradient>
</defs>
</svg>

            </div>
            <div className='flex flex-col items-end justify-center w-[200px]' >
            <span className='text-[#8061D9] tracking-widest font-sans pb-1'>0 7   L E V E L S</span>
            <h1 className='text-[#312651] font-bold text-xl font-[YekanBakh-ExtraBold]'>شکوفایی برند زنانه</h1>
            </div>
           
          </div>
          <div className="flex items-center justify-center leading-5 w-full" dir="rtl">
            <p className='text-[#312651] leading-6 text-[14px] md:text-[13px] w-full font-[IranSans]'>زنان، همواره در مسیر زندگی خود با چالش ها، فشار ها و توقعات اجتماعی و فرهنگی مواجه اند که گاه آنها را از خود حقیقی شان دور می کند.</p>
          </div>
         </div>
         </Link>

         

       </div>
      
  )
}

export default Description
