import React from 'react'


function WhyUs () {
  return (
    <div className=' min-w-[390px] max-w-[639px] flex flex-col items-center justify-center pt-2' >
         <div className='relative'>
          <img src="./images/whyUsImg.png" alt="why us?" />
          <svg className='absolute top-[110px] left-[135px]' width="61" height="72" viewBox="0 0 61 72" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M59.7552 21.3142C58.4766 16.4454 55.0538 11.0432 51.1782 7.68007C34.9582 -6.40083 8.78289 -0.324381 1.82902 19.4187C-0.338019 25.5709 -0.195638 39.4325 0.325476 46.1453C0.872218 53.1749 4.69372 59.8254 9.87068 64.6915L12.2741 62.3871C16.9726 57.1203 17.9067 52.0268 16.8359 45.203C10.3605 46.2022 8.66614 33.4346 13.9769 32.3108C17.0324 31.6636 18.2113 35.4194 18.5445 35.1784C19.7661 31.6501 21.9588 28.8231 25.0029 26.5593C30.0261 22.8252 38.4494 20.9161 35.485 12.9794C35.0094 11.7067 34.1124 10.5775 33.355 9.45643C38.5063 11.1407 40.9125 17.1711 46.6277 17.8183C47.7354 17.9429 48.8602 17.7398 49.968 17.8914C51.4231 18.3653 53.5218 27.8455 53.0206 29.5975C48.2224 30.8594 45.5798 33.2965 47.6557 38.2329C48.3448 39.8685 51.3291 43.099 49.9964 44.6424C48.903 45.907 47.2855 45.8772 47.8522 48.4199L45.5342 48.2249L38.7683 51.293C41.5504 52.4492 44.6799 52.4059 47.593 51.6991C48.1455 55.8368 44.9533 55.6066 41.9035 54.4043L41.6187 56.8414C47.519 54.9838 47.0121 60.9221 42.043 61.4447C36.2453 62.054 28.5283 56.53 24.1002 53.3211C23.8838 53.2778 23.918 53.5811 23.9635 53.7219C24.5986 55.6553 27.3864 59.6846 28.8102 61.3012C30.029 62.6849 34.2292 65.7069 34.4029 67.0338C34.4428 67.3316 34.2093 67.708 34.2491 68.0465C34.4057 69.3598 34.6392 70.6867 34.7902 72C47.556 70.5675 58.4396 60.3453 60.3675 48.271C61.3129 42.3353 61.2673 27.044 59.7609 21.3142H59.7552Z" fill="#312651"/>
<path d="M31.6521 35.0458C36.9743 38.6526 43.5551 37.2337 45.0103 30.8702C40.3544 28.3546 35.559 28.2328 30.5102 29.7681L36.5471 30.6563L40.474 32.3379C37.2249 31.8694 33.8533 32.6087 31.6521 35.0458Z" fill="#312651"/>
</svg>
         <h1 className='text-[#8061D9] font-bold text-xl absolute top-[200px] left-[83px] font-[YekanBakh-Bold]'>چرا ما را انتخاب کنید؟</h1>
         </div>
         <div>
          <p className="text-[#312651] flex items-center justify-center pt-10 w-[290px] font-[IranSans]" dir="rtl">امروزه منابع فراوانی برای رشدفردی و برندسازی و حوزه های سلامت و زیبایی وجود دارد، اما ما باور داریم هر مسیر شکوفایی باید از عمق و اصالت شروع شود.</p>
          <p className="text-[#312651] flex items-center justify-center py-10 w-[290px] font-[IranSans]" dir="rtl">و تنها با ترکیب اعتماد سازی درونی و برندسازی شخصی و حوزه های سلامت و زیبایی می توان برندی ساخت که هم قدرتمند، هم ماندگار و حقیقی باشد
</p>
         </div>
         <div>
          <button className=" w-[202px] h-10 flex justify-center items-center py-2 px-[11px] gap-1 bg-white border border-[#D5CFE6] rounded-[8px] text-base text-[#312651] font-[IranSans]">
...مطالعه بیشتر
         </button>

         </div>
    </div>
  )
}

export default WhyUs
